import React from "react";
import ImgInfoRow from "../../components/ImgInfoRow";
import InfoImgRow from "../../components/InfoImgRow";
import InfoRow from "../../components/InfoRow";

export default function acupuncture() {
  return (
    <main className="container mb-5">
      <div className="heading d-flex justify-content-center pt-3 pt-md-5">
        ฝังเข็ม
      </div>
      <InfoImgRow
        titleText="คือ?"
        descText="เป็นเวชกรรมการรักษาโรคของจีนที่มีประวัติการค้นคว้าและแพร่หลายมาหลายพันปี การฝังเข็มเป็นวิธีการรักษาโรค ฟื้นฟูสุขภาพ สร้างเสริมสุขภาพและป้องกันโรค โดยการใช้เข็มปักตามตำแหน่งจุดเฉพาะต่าง ๆ ของร่างกาย มีวัตถุประสงค์เพื่อปรับสมดุลร่างกาย ช่วยปรับให้อวัยวะและระบบการทำงานต่าง ๆ ของร่างกายกลับทำงานได้เป็นปกติ โดยเฉพาะที่โดดเด่นในการระงับอาการเจ็บปวด จึงนำไปใช้ในการรักษาโรคปวดต่าง ๆ ได้ดี"
        imgPath="/about-01.jpg"
      />
      <ImgInfoRow
        titleText="ประโยชน์"
        descText="การฝังเข็ม เป็นการรักษาอาการปวด
        โดยไม่ต้องใช้ยาเพื่อหลีกเลี่ยงโอกาสในการแพ้ยา
        ผลข้างเคียงจากยาและปัญหาการติดยาแก้ปวด
        รวมทั้งเป็นทางเลือกสำหรับผู้ที่เคยรักษาอาการปวดด้วยวิธีอื่นๆแล้วไม่ได้ผล"
        imgPath="/about-01.jpg"
        textList={[
          "แก้ไขการไหลเวียนของเลือดลมปราณที่ติดขัด",
          "ปรับสภาพความสมดุลการทำงานของอวัยวะต่าง ๆ ในร่างกายให้อยู่ในสมดุล",
          "กระตุ้นภูมิคุ้มกันในร่างกายเพื่อกำจัดเหตุปัจจัยที่เป็นอันตรายออกไปจากร่างกาย",
          "ช่วยบรรเทาความเจ็บปวด และช่วยในการหดเกร็งตัวของกล้ามเนื้อ ",
        ]}
      />
      <InfoRow
        titleText="เพิ่มเติม"
        descText="
            องค์การอนามัยโลก (WHO)
            ให้การรับรองและระบุโรคที่สามารถรักษาได้ด้วยการฝังเข็ม
            รวมทั้งล่าสุดยังมีหลายงานวิจัยพบว่า โรคบางโรค เช่น กรดไหลย้อน ปวดหัว
            ปวดศีรษะไมเกรน การรักษาด้วยการฝังเข็มให้ผลการรักษาดีเทียบเท่า หรือ
            มากกว่าการใช้ยา โดยปลอดภัย
            และไม่ต้องเสี่ยงต่อผลข้างเคียงจากยาอีกด้วย
            โดยกลุ่มโรคและอาการที่พบบ่อยมีดังนี้ 
         "
        textList={[
          "กลุ่มอาการปวดและโรคทางระบบกล้ามเนื้อ เช่น Office syndrome ปวดหลังปวดต้นคอ ปวดไหล่ ปวดเข่า ปวดศีรษะ ปวดไมเกรน",
          "กลุ่มโรคระบบประสาท เช่น ชาปลายมือ ปลายเท้า อัมพฤกษ์ อัมพาตโรคอัมพาตใบหน้า กล้ามเนื้ออ่อนแรง ",
          "กลุ่มโรคระบบทางเดินหายใจ เช่น ภูมิแพ้ หวัดเรื้อรังและหอบหืด",
          "กลุ่มโรคระบบต่อมไร้ท่อ เช่น เบาหวาน ความดันโลหิตสูง ความดันต่ำ",
          "กลุ่มโรคระบบทางเดินอาหารและลำไส้ เช่น กรดไหลย้อน ท้องผูก อาหารไม่ย่อย",
          "กลุ่มโรคทางนรีเวช เช่น ปรับสมดุล ปรับฮอร์โมน ประจำเดือนมาไม่ปกติ เข้าสู่วัยทอง ทั้งบุรุษและสตรี และเสื่อมสมรรถภาพทางเพศ",
          "กลุ่มโรคอื่นๆ เช่น การฝังเข็มเพื่อเสริมสุขภาพ เช่น เครียด กังวล ซึมเศร้า นอนไม่หลับ",
        ]}
      />

      <InfoRow
        titleText="การเตรียมตัวก่อนการฝังเข็ม"
        textList={[
          "รับประทานอาหารตามปกติให้อิ่มก่อนเข้ารับการฝังเข็ม 1-2 ชั่วโมง ไม่มากจนเกินไป เพราะถ้าฝังเข็มในช่วงผู้ป่วยอ่อนเพลียหิวหรือแน่นท้องมากจะมีโอกาสเสี่ยงต่อการเป็นลมได้ง่าย",
          "นอนหลับพักผ่อนอย่างเพียงพอ 6 - 8 ชั่วโมง ในคืนก่อนมาเข้ารับการฝังเข็ม",
          "สวมใส่เสื้อผ้าให้เหมาะสมไม่ควรรัดแน่นจนเกินไป",
          "รับทราบข้อปฏิบัติตัวและข้อห้ามในการฝังเข็ม",
          "ปิดเครื่องมือสื่อสารทุกชนิด",
          "วัดสัญญาณชีพก่อนเข้ารับการฝังเข็มทุกราย",
        ]}
      />
      <InfoRow
        titleText="ข้อแนะนำในการฝังเข็ม"
        textList={[
          "	ขณะฝังเข็ม ควรอยู่ในท่าที่แพทย์กำหนด โดยไม่ขยับร่างกาย ไม่เครียดจนเกินไป หรือตามคำแนะนำของแพทย์",
          "	ขณะรับการฝังเข็ม อาจมีอาการผิดปกติ เช่น มีอาการปวดมากขึ้น หน้ามืดใจสั่นเป็นลม ต้องรีบแจ้งให้แพทย์หรือพยาบาลทราบทันที",
          "	หลังจากที่ฝังเข็มและปักเข็มไว้แล้ว ควรนั่งพักหรืออยู่ในท่านั้นๆ เป็นระยะเวลาประมาณ 25-30 นาที หรือตามที่แพทย์กำหนด ไม่ควรขยับเขยื้อนแขนขา หรือบริเวณที่ฝังเข็มไว้ จนครบเวลา",
        ]}
      />
      <InfoRow
        titleText="อ้างอิง"
        textList={[
          "https://med.mahidol.ac.th/altern_med/th/acupuncture_km",
          "https://www.huachiewtcm.com/content/5859/ฝังเข็มรักษาโรคได้อย่างไร-",
        ]}
      />
    </main>
  );
}
